input_openfoam/tutorials/incompressible/pimpleFoam/RAS/oscillatingInletACMI2D/Allrun.pre
#!/bin/sh
cd ${0%/*} || exit 1                        # Run from this directory
. $WM_PROJECT_DIR/bin/tools/RunFunctions    # Tutorial run functions

runApplication blockMesh

runApplication topoSet -constant

# Split the mesh to generate the ACMI coupled patches
runApplication createBaffles -overwrite

restore0Dir

#------------------------------------------------------------------------------
